bazanski/espDash/firmware/esp32-gateway/src/main.cpp
    can_decode_init(&g_state);
    can_decode_init(&g_snapshot);

    Serial.println("\n=================================================================");
    Serial.println(" espDash CENTRAL CAN GATEWAY (2014 HONDA CIVIC 9TH GEN)");
    Serial.println(" BAUD  : 500 kbps (TWAI_MODE_LISTEN_ONLY - never transmits)");
    Serial.printf(" PROTO : ESP-NOW v%d.%d, %u byte packet\n",
                  ESPDASH_PROTO_MAJOR, ESPDASH_PROTO_MINOR, (unsigned)ESPDASH_PACKET_SIZE);
    Serial.println("=================================================================");

    if (install_twai()) {
        Serial.println("[TWAI] Installed on GPIO15(TX)/GPIO16(RX), rx_queue_len=512");
    } else {
        Serial.println("[TWAI] INSTALL FAILED");
    }

#if ESPDASH_GATEWAY_WIFI
    wifiMulti.addAP("Comlex_parking", "12345678");
    wifiMulti.addAP("Complex_parking", "12345678");
    wifiMulti.addAP("Bazanski_ph", "52288488");
    wifiMulti.addAP("Bazanski_IS", "52288488");
    wifiMulti.addAP("IOT-monday", "fsdL2Dp*KBU0y#9F&c!Zbq853axj");

    WiFi.mode(WIFI_AP_STA);

    Serial.println("[Wi-Fi] Connecting (max 15s)...");
    uint32_t t0 = millis();
    bool connected = false;
    while (millis() - t0 < 15000) {
        if (wifiMulti.run() == WL_CONNECTED) { connected = true; break; }
        delay(150);
    }

    if (connected) {
        WiFi.setAutoReconnect(true);
        Serial.printf("[Wi-Fi SUCCESS] IP: %s (SSID: %s, MAC: %s, mDNS: esp32-gateway.local)\n",
                      WiFi.localIP().toString().c_str(), WiFi.SSID().c_str(),
                      WiFi.macAddress().c_str());
        if (MDNS.begin("esp32-gateway")) {
            MDNS.addService("espdash", "tcp", 8889);
            MDNS.addServiceTxt("espdash", "tcp", "mac", WiFi.macAddress());
            MDNS.addServiceTxt("espdash", "tcp", "device", "gateway");
        }
        ArduinoOTA.onStart([]() { ota_in_progress = true; });
        ArduinoOTA.onEnd([]() { ota_in_progress = false; });
        ArduinoOTA.onError([](ota_error_t) { ota_in_progress = false; });
        ArduinoOTA.begin();
        webSocket.begin();
        webSocket.onEvent(onWebSocketEvent);
        telnetServer.begin();
        telnetServer.setNoDelay(true);
    } else {
        Serial.println("[Wi-Fi TIMEOUT] Not connected. Locking to fixed channel for ESP-NOW.");
        WiFi.disconnect(true, true);
        WiFi.mode(WIFI_STA);
        esp_wifi_set_channel(ESPDASH_ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
    }
#else
    // No Wi-Fi station is ever attempted: no association, no scanning, no
    // roaming, and therefore nothing for a runtime fallback to abandon. This
    // is what actually fixed the on-car ESP-NOW instability - see the banner
    // comment at the top of this file. Set ESPDASH_GATEWAY_WIFI=1 in
    // platformio.ini and rebuild to restore mDNS/OTA/WebSocket/Telnet.
    Serial.println("[Wi-Fi] Disabled at build time (ESPDASH_GATEWAY_WIFI=0). USB + ESP-NOW only.");
    // Order matters: disconnect(true, true)'s second argument stops the Wi-Fi
    // radio outright (esp_wifi_stop()). WiFi.mode(WIFI_STA) must come AFTER
    // it, since that's what restarts the radio into STA mode - reversing
    // this order leaves the interface down and esp_now_send() failing with
    // ESP_ERR_ESPNOW_IF on every call, which is exactly what happened here
    // the first time this was written with the calls the other way round.
    WiFi.disconnect(true, true);
    WiFi.mode(WIFI_STA);
    esp_wifi_set_channel(ESPDASH_ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
#endif

    // Wi-Fi STA modem sleep makes the radio doze between DTIM beacons, which
    // costs ESP-NOW packets on both ends of the link. The gateway is mains/
    // vehicle powered, so trade the power for a dependable 20 Hz.
    esp_wifi_set_ps(WIFI_PS_NONE);

    init_esp_now();

    // Both application tasks live on core 1; core 0 is left to the Wi-Fi/lwIP
    // stack AND the TinyUSB device task, which is what actually drains the USB
    // CDC FIFO. Running publishTask on core 0 starves that task and silently
    // drops CDC bytes - measured as ~10% byte loss shredding 58% of telemetry
    // lines into fragments, against 0 fragments with both tasks on core 1.
    //
    // Nothing is lost by this placement: canRxTask at priority 10 preempts
    // publishTask at 5, so a blocking write still cannot delay CAN reception,
    // which is the entire point of the split.
    xTaskCreatePinnedToCore(canRxTask,   "canRx",   4096, NULL, 10, NULL, 1);
    xTaskCreatePinnedToCore(publishTask, "publish", 8192, NULL, 5,  NULL, 1);

    Serial.println("[SYSTEM] Gateway ready. canRxTask@core1 prio10, publishTask@core1 prio5.");
}

// =========================================================================
// LOOP (core 1, prio 1) - Wi-Fi/OTA maintenance when enabled, TWAI recovery
// always
// =========================================================================
void loop() {
    static uint32_t last_diag = 0;
    uint32_t now = millis();

#if ESPDASH_GATEWAY_WIFI
    static uint32_t last_wifi_check = 0;
    static uint32_t wifi_lost_since = 0;

    if (WiFi.status() == WL_CONNECTED) {
        ArduinoOTA.handle();
    }

    if (now - last_wifi_check >= 5000) {
        last_wifi_check = now;
        if (WiFi.status() == WL_CONNECTED) {
            wifi_lost_since = 0;
            String ip = WiFi.localIP().toString();
            if (ip != last_connected_ip) {
                last_connected_ip = ip;
                Serial.printf("[Wi-Fi] Connected IP: %s (SSID: %s)\n",
                              ip.c_str(), WiFi.SSID().c_str());
            }
        } else {
            last_connected_ip = "";

            // Wi-Fi that connected at boot and later drops (car drives out of
            // AP range) is NOT the same case as "no AP found within 15s at
            // boot" - only the latter was ever handled, by locking to a fixed
            // channel once in setup(). At runtime, WiFi.setAutoReconnect(true)
            // instead leaves the radio scanning/roaming indefinitely, which
            // means the ESP-NOW peer's channel=0 ("follow the station") is
            // tracking a channel that keeps moving or is transiently
            // undefined mid-reconnect. esp_now_send() can then fail silently
            // - nothing checked its return value before espnow_send_fail was
            // added - and the display node's own channel sweep has no fixed
            // target to lock onto, so it searches indefinitely. A full
            // gateway reboot "fixes" it only because it re-runs the boot-time
            // timeout path and lands back on a stable, fixed channel.
            //
            // This mitigation is what ESPDASH_GATEWAY_WIFI=0 (the default)
            // supersedes: with no Wi-Fi ever attempted, there's nothing to
            // lose and nothing to abandon. Kept here, gated, for when Wi-Fi
            // is deliberately re-enabled.
            if (!wifi_fallback_engaged) {
                if (wifi_lost_since == 0) {
                    wifi_lost_since = now;
                } else if (now - wifi_lost_since >= 20000) {
                    wifi_fallback_engaged = true;
                    Serial.println("[Wi-Fi] Lost for 20s - abandoning reconnect, "
                                   "locking ESP-NOW to a fixed channel for stability");
                    WiFi.setAutoReconnect(false);
                    WiFi.disconnect(true, true);
                    WiFi.mode(WIFI_STA);
                    esp_wifi_set_channel(ESPDASH_ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
                }
            }
        }
    }
#endif

    if (now - last_diag >= 5000) {
        last_diag = now;

        uint32_t alerts = 0;
        if (twai_read_alerts(&alerts, 0) == ESP_OK) {
            if (alerts & TWAI_ALERT_RX_QUEUE_FULL) twai_queue_full_events++;
        }

        twai_status_info_t st;
        if (twai_get_status_info(&st) == ESP_OK) {
            if (st.state == TWAI_STATE_BUS_OFF)      twai_initiate_recovery();
            else if (st.state == TWAI_STATE_STOPPED) twai_start();
        }
    }

    vTaskDelay(pdMS_TO_TICKS(10));
}
